using System.Collections;
using System.Collections.Generic;
using UnityEngine;

//public class Zamitka : MonoBehaviour
{
    //рівень базовий 
    //рівень складатиметься з неактивних участків які гравець буде купляти за злоті отримані в квестах, гравець спочатку має тільки один участок(та  де забор)
    //за купівлю земель, проходження квестів будуть начислятись бали,
    //є концепція рівень базовий 2
    // ідеї для квестів: пошук скарбів(у виді платформеру,лабіринт ), скачки на лошидях, стрільба з луку.
    // за рахунок отриманих балів можна зробити механіку не передбачуваних витрат наприклад: гравець набрав 100 балів і його пограбували і він втратив 110 злотих, а може набрати знову 100 балів але в цей раз нічого не відбудеться
}
